# 1. Explain dimension reduction in machine learning.

# Ans- Dimensionality reduction refers to techniques that reduce the number of input variables in a dataset.Your feature set could be a dataset with a hundred columns (i.e features) or it could be an array of points that make up a large sphere in the three-dimensional space.

# 2.How can you handle duplicate values in a dataset for a variable in Python using pandas?

# Import

In [107]:
import pandas as pd

# Read The File

In [108]:
df=pd.read_csv("E:\\dataset\\Emply.csv")
df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,Legal
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,Finance
4,Lillian,Female,1/24/1998,4:47 PM,101004,1.389,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,Legal
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,Product
7,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,Marketing
8,Maria,Female,11/22/2005,6:29 AM,95570,18.523,Engineering
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,Business Development
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,NaN
11,Julie,Female,10/26/1997,3:19 PM,102508,12.637,Legal
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,Sales
14,Kimberly,Female,1/14/1999,7:13 AM,41426,14.543,Finance
15,Lillian,Female,6/5/2016,6:09 AM,59414,1.256,Product
16,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,Legal
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,Product
18,Diana,Female,10/23/1981,10:27 AM,132940,19.082,Client Services
19,Johnny,Male,11/6/2009,4:23 PM,118172,16.194,Sales
20,Dennis,Male,5/7/2007,10:01 AM,54043,3.833,Product
21,Frances,Female,4/4/1999,4:19 PM,90582,4.709,Sales
22,Dennis,Male,5/7/2007,10:01 AM,54043,3.833,Product
23,Bonnie,Female,7/2/1991,1:27 AM,104897,5.118,Human Resources
24,Margaret,Female,9/10/1988,12:42 PM,131604,7.353,Distribution
25,Thomas,Male,9/14/2004,8:13 PM,107391,1.260,Marketing
26,Robin,Female,6/4/1983,3:15 PM,114797,5.965,Sales
27,Bonnie,Female,11/13/1988,3:30 PM,115814,4.990,Product
28,Brandon,Male,3/17/1995,12:50 AM,137126,15.602,Sales

In [109]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16     True
17    False
18    False
19    False
20    False
21    False
22     True
23    False
24    False
25    False
26    False
27    False
28    False
dtype: bool

# Check Total duplicated row

In [110]:
df.duplicated().sum()

3

# Check duplicated value in a Particular Column

In [111]:
df['First Name'].duplicated().sum()

10

# Check duplicated row in whole dataset

In [112]:
df.loc[df.duplicated(keep= False), :]

   First Name Gender Start Date Last Login Time  Salary  Bonus %       Team
0     Douglas   Male   8/6/1993        12:42 PM   97308    6.945  Marketing
1      Thomas   Male  3/31/1996         6:53 AM   61933    4.170      Legal
7     Douglas   Male   8/6/1993        12:42 PM   97308    6.945  Marketing
16     Thomas   Male  3/31/1996         6:53 AM   61933    4.170      Legal
20     Dennis   Male   5/7/2007        10:01 AM   54043    3.833    Product
22     Dennis   Male   5/7/2007        10:01 AM   54043    3.833    Product

# Drop duplicated value in whole dataset

In [113]:
df.drop_duplicates(keep= False).shape

(23, 7)

In [114]:
df.duplicated(subset=['First Name','Gender']).sum()

10

In [115]:
df.drop_duplicates(subset=['First Name','Gender']).shape

(19, 7)